Revit 2027 API
FamilyLoadedIntoDocumentEventArgs.NewFamilyId Property
 The newly loaded family id.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NewFamilyId { get; }
Public ReadOnly Property NewFamilyId As ElementId
	Get
public:
property ElementId^ NewFamilyId {
	ElementId^ get ();
}
member NewFamilyId : ElementId with get
Property Value
ElementId
See Also
Reference
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace